app/Controllers/Dashboard.php

    public function index()
    {
        $data = [
            'judul'             => "Dashboard",
            'jml_pengguna'      => $this->userModel->countAll(),
            'jml_paket'         => $this->paketModel->countAll(),
            'jml_member'        => $this->memberModel->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `user`
SELECT COUNT(*) AS `numrows` FROM `paket`
SELECT COUNT(*) AS `numrows` FROM `member`