app/Models/BahanModel.php

SELECT *
FROM `bahan`
ORDER BY `id_bahan` DESC
---
    public function getBahan($id_bahan = false)
    {
        if ($id_bahan == false) {
            return $this->orderBy('id_bahan', 'desc')->findAll();