app/Models/BiayaTambahanModel.php

SELECT *
FROM `biaya_tambahan`
ORDER BY `id_transaksi` DESC
---
    public function getBiayaTambahan($id_transaksi = false)
    {
        if ($id_transaksi == false) {
            return $this->orderBy('id_transaksi', 'desc')->findAll();