app/Models/DetailTransaksiModel.php

    public function getDetailTransaksi($id_transaksi = false)
    {
        if ($id_transaksi == false) {
            return $this->orderBy('id_transaksi', 'desc')->findAll();
        }

        return  $this->where([
            'id_transaksi' => $id_transaksi
        ])->findAll();
---
SELECT *
FROM `detail_transaksi`
ORDER BY `id_transaksi` DESC
SELECT *
FROM `detail_transaksi`
WHERE `id_transaksi` = '59'