app/Models/MemberModel.php

    public function getMember($id_member = false)
    {
        if ($id_member == false) {
            return $this->orderBy('id_member', 'desc')->findAll();
---
SELECT *
FROM `member`
ORDER BY `id_member` DESC