app/Models/PaketModel.php

SELECT *
FROM `paket`
ORDER BY `id_paket` DESC
---
    public function getPaket($id_paket = false)
    {
        if ($id_paket == false) {
            return $this->orderBy('id_paket', 'desc')->findAll();