app/Models/TransaksiModel.php

SELECT *
FROM `transaksi`
JOIN `member` ON `member`.`id_member` = `transaksi`.`id_member`
ORDER BY `id_transaksi` DESC
SELECT *
FROM `transaksi`
WHERE `id_transaksi` = '59'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `member` ON `member`.`id_member` = `transaksi`.`id_member`
WHERE `status` = 'Diambil'
ORDER BY `id_transaksi` DESC
---
    public function getTransaksi($id_transaksi = false, $status = false)
    {
        if ($status == false && $id_transaksi == false) {
            return $this->orderBy('id_transaksi', 'desc')
                ->join('member', 'member.id_member = transaksi.id_member')
                ->findAll();
        }

        if ($id_transaksi != false) {
            return  $this->where([
                'id_transaksi' => $id_transaksi
            ])->first();
        }

        if ($status != false) {
            return  $this->where(['status' => $status])
                ->orderBy('id_transaksi', 'desc')
                ->join('member', 'member.id_member = transaksi.id_member')
                ->get()
                ->getResultArray();