app/Models/UserModel.php

SELECT *
FROM `user`
ORDER BY `id_user` DESC
---
    public function getUser($id_user = false)
    {
        if ($id_user == false) {
            return $this->orderBy('id_user', 'desc')->findAll();